{
  "sections": {
    "main": {
      "type": "article-header",
      "settings": {
        "pre-title": "BUYING GUIDE",
        "checkAuthor": true,
        "checkDate": true,
        "checkReadTime": false,
        "icon": "https:\/\/cdn.shopify.com\/s\/files\/1\/0248\/6163\/8710\/files\/Price-tag.svg?v=1690619081",
        "frameText": "Tempur-Pedic has memory foam mattresses at different price points for pressure relief and restorative sleep"
      }
    },
    "17e412db-3680-4e78-8669-fb18b9a93869": {
      "type": "article-content",
      "blocks": {
        "1a590ddc-2ad7-46f6-9d96-57c79b562975": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": false,
            "bottom": true
          }
        },
        "0bde299d-d2ed-4afa-8d44-dde79fc1bde8": {
          "type": "menu",
          "settings": {
          }
        },
        "00c5c3c8-f44e-4fff-8011-b53508dad711": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "a048c091-0c87-4ea9-9aa2-63074b6a64c7": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/Tempurpedic_Logo_Bar_248e83f0-9c0b-4ce3-a7cc-b527acf9def9.jpg",
            "title": "",
            "img_color": "rgba(0,0,0,0)",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "7864ce1f-275d-420f-b8dc-534cbfd3ee27": {
          "type": "text",
          "settings": {
            "index_par": "About Tempur-Pedic",
            "content": "<h2>About Tempur-Pedic<\/h2><p><br\/><br\/>Tempur-Pedic, (now part of Tempur Sealy International), has been revolutionizing the mattress industry for more than two decades with cutting-edge designs and superior mattress construction. They're constantly staying on top of the latest mattress technologies and evolving their mattresses to remain at the top of the pack. The Tempur memory foam formula remains a guarded secret. When you choose Tempur ProAdapt or any of the classic collections, you can rest assured that you're getting an innovative, smartly designed mattress unlike any other.  The best Tempur-Pedic mattresses give you value for money!<br\/><br\/>At the heart of all Tempur-Pedic mattresses is a steadfast commitment to quality. There's a reason their name is so ubiquitous, and it's because they truly care about giving their customers their best sleep possible. They're an excellent mix of quality and comfort in most Tempur-Pedic Mattresses and are perfect for anyone looking for a well-made mattress to support them for years to come. <br\/><br\/>One of the most notable, unique features of a Tempur-Pedic is its material. The proprietary TEMPUR material isn't like ordinary memory foam mattress. Tempur-Pedic mattresses are made with pressure-relieving material originally developed by NASA to absorb the G-Force of astronauts during lift off, then perfected by us for sleep.<br\/><br\/>Another benefit to Tempur-Pedic over normal memory foam mattresses is that they can be paired with an <a href=\"\/collections\/tempur-pedic-adjustable-base-collection\" target=\"_blank\" title=\"Tempur-Pedic® Adjustable Bases\">adjustable base<\/a> for even more supportive and comfortable sleep. With an adjustable base, you can shift your mattress into a variety of different positions to help with pain, mobility issues, comfort levels, and even certain sleep disorders. If you want a highly-functional, customizable, and comfortable sleep situation, a Tempur-Pedic combined with an adjustable base may just be your perfect fit. The memory foam comfort layers offer you just enough softness to side or back sleepers.<br\/><br\/>To make it even better, if you shop with Sleep First, you get an exclusive 20-year warranty on any Tempur Pedic's line of mattresses. Few online mattresses stores can't match up our offers. When you buy a Tempur-Pedic® mattress at Sleep First, the first 10 years of the warranty are covered directly by the manufacturer, Tempur-Pedic® themselves. Sleep First offers you an exclusive EXTRA TEN YEARS covered directly by ServeCo, a global leader serving huge companies and their customers for more than three decades. That means no matter what happens to us, you're covered. You can rest easy knowing that your investment is comfortable and protected.<br\/><br\/>Are you liking the sound of this and wondering what the different choices are?<br\/><br\/>The TEMPUR Mattress Collection has an array of mattresses with the latest advancements in mattress technology for you to choose from. You can find a nice mattress within the Tempur-Pedic firmness scale. Ditch your old mattress and get a new mattress that promotes spinal alignment and ensures natural, healthy sleep position every night, even for hot sleepers!<br\/><br\/>Here are a few of our top Tempur-Pedic picks:<br\/><br\/><\/p>"
          }
        },
        "294863e7-3749-4c70-b0b5-11a26dcfc911": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "7388edfa-1b33-44da-8af4-aa6568244ef5": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/Adapt_600x600-High-Quality.jpg",
            "title": "",
            "img_color": "",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "9e7f9717-3fb8-4886-a312-07b884bf27ae": {
          "type": "text",
          "settings": {
            "index_par": "Tempur-Adapt® Collection",
            "content": "<h2>Tempur-Adapt® Collection<br\/><br\/><\/h2><h3><a href=\"\/products\/tempurpedic-adapt-medium-mattress\" target=\"_blank\" title=\"TEMPUR-Adapt Medium Mattress\">TEMPUR-Adapt Medium Mattress <\/a><\/h3><p><br\/>The original and legendary Tempur-Pedic formulation! This mattress features the original Tempur-Pedic technology. The TEMPUR-Adapt® Medium Mattress is guaranteed to support you so you don't wake up with that lower back pain anymore! The 11” profile looks awesome and works beautifully with any sheets or adjustable power base, and this mattress will give you the best night's sleep no matter what position you prefer. <\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>TEMPUR-ES® Comfort Layer - 4cm<\/strong><br\/>Softer feel works in combination with other materials to support and relax.\t<\/li><li><strong>Original TEMPUR® Support Layer - 4cm<\/strong><br\/>Advanced, all-night adaptability for truly personalized comfort and support.<br\/><\/li><\/ol><h3><a href=\"\/products\/tempuradapt-medium-hybrid-mattress\" target=\"_blank\" title=\"TEMPUR-Adapt Medium Hybrid Mattress\">TEMPUR-Adapt Medium Hybrid Mattress<\/a><\/h3><p><br\/><br\/>This mattress uses that legendary technology Tempur-Pedic is known for combined with the wonderful ease of movement that only coils can provide. The TEMPUR-Adapt® Medium Hybrid Mattress has a cover that is cool to the touch and helps protect against allergens. It has a true medium feel, meaning you will be supported and super-comfy no matter what sleeping position you prefer! The TEMPUR-Adapt® Medium Hybrid mattress is available in Twin, Twin XL, Full (Double), Queen, King, Cal King and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>TEMPUR-ES® Comfort Layer - 3cm<\/strong><br\/>Softer feel works in combination with other materials to support and relax.<\/li><li><strong>Original TEMPUR® Support Layer - 5cm<\/strong><br\/>Advanced, all-night adaptability for truly personalized comfort and support.<\/li><li><strong>Proprietary Hybrid Technology<\/strong><br\/>1,000+ premium spring coils provide additional edge support and easier movement.<br\/><\/li><\/ol>"
          }
        },
        "df7b3de4-8f5b-4afc-a5d4-03f623f572d1": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "a6e87b17-5469-44ab-aeaa-11878cd587fa": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/Tempurpedic_T2_ProAdapt_Hybrid_SILO_MattressOnly_BillboardFront_Charcoal_Queen_Nov17_RL1-0717_5x7_251218041140267523_f57bda11-6b07-4193-bafa-b93b10bf2934.jpg",
            "title": "",
            "img_color": "",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "85c24529-c44f-46e7-8efc-9b87edbaa59b": {
          "type": "text",
          "settings": {
            "index_par": "Tempur-ProAdapt® Collection",
            "content": "<h2>Tempur-ProAdapt® Collection<\/h2><h3><br\/><\/h3><p>For those looking for the proadapt, you have four options.<\/p><h2><br\/><a href=\"\/products\/tempurpedic-proadapt-firm-mattress\" target=\"_blank\" title=\"Tempur-Pedic ProAdapt Firm Mattress\">Tempur-Pedic ProAdapt Firm Mattress<\/a><\/h2><p><br\/><br\/>With the Tempur-Pedic ProAdapt® Firm Mattress you get incredibly firm support combined plus advanced pressure relief. It features APR™ Material, the most pressure-relieving material ever made by TEMPUR. that conforms to your body to ease pressure at all major pressure points in your body. This mattress comes with a zip-off, machine washable cover, making it super quick and easy to toss your mattress cover in the wash. This model is one of the firmer mattress lines that Tempur-Pedic offers, so if you're looking for very firm support, this is for you. Tempur-Pedic ProAdapt® Firm Mattress is available in Twin, Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<br\/><\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>TEMPUR-APR™ Comfort Layer - 3cm<\/strong><br\/>Our most pressure-relieving material ever — made for deeper, more rejuvenating sleep.<\/li><li><strong>Original TEMPUR® Support Layer - 5cm<\/strong><br\/>Advanced, all-night adaptability for truly personalized comfort and support.<br\/><\/li><\/ol><h3><a href=\"\/products\/tempurpedic-proadapt-medium-hybrid-mattress\" target=\"_blank\" title=\"Tempur-Pedic ProAdapt Medium Hybrid Mattress\">Tempur-Pedic ProAdapt Medium Hybrid Mattress<\/a><\/h3><p><br\/>If you've found that you love the feeling of Tempur-Pedic, but still feel attached to that traditional feeling of a bouncy innerspring mattress, you're in for a treat! The Tempur-Pedic ProAdapt® Medium Hybrid Mattress combines the best of both worlds. This ProAdapt® model will give you the best pressure relieving technology thanks to its APR™ Material and the easy movement provided by coils to give you the best night's sleep you've ever had. Ideal for many sleeping positions and preferences. It's available in Twin, Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King mattress.<br\/><\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>TEMPUR-ES® Comfort Layer - 6cm<\/strong><br\/>Softer feel works in combination with other materials to support and relax.<\/li><li><strong>TEMPUR-APR™ Support Layer - 4cm<\/strong><br\/>Our most pressure-relieving material ever — made for deeper, more rejuvenating sleep.<\/li><li><strong>Proprietary Hybrid Technology<\/strong><br\/>1,000+ premium spring coils provide additional edge support & easier movement.<br\/><\/li><\/ol><p><\/p><h3><a href=\"\/products\/tempurpedic-proadapt-medium-mattress\" target=\"_blank\" title=\"Tempur-Pedic ProAdapt Medium Mattress\">Tempur-Pedic ProAdapt Medium Mattress<\/a><\/h3><p><br\/>Tired of tossing and turning to find that perfect position every night? Check out this, the Tempur-Pedic ProAdapt® Medium Mattress has some of the best pressure-relieving technology available, so you wake up ache-free and fully refreshed. With a medium comfort feel, this mattress is a great choice for all sleeping positions and preferences. It's available in Twin, Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>Original TEMPUR® Comfort Layer - 5cm<\/strong><br\/>Advanced, all-night adaptability for t ruly personalized comfort and support.<\/li><li><strong>TEMPUR-APR™ Support Layer - 5cm<\/strong><br\/>Our most pressure-relieving material ever — made for deeper, more rejuvenating sleep.<br\/><\/li><\/ol><h3><a href=\"\/products\/tempurpedic-proadapt-soft-mattress\" target=\"_blank\" title=\"Tempur-Pedic ProAdapt Soft Mattress\">Tempur-Pedic ProAdapt Soft Mattress<\/a><\/h3><p><br\/>The Tempur-Pedic ProAdapt® Soft Mattress gives you the amazing comfort of a soft mattress without feeling like you're sleeping on a marshmallow. It has some of the best pressure-relieving technology available so you don't toss and turn all night, and will give you the most rejuvenating night's sleep you've ever had! This is one of the softer mattresses Tempur-Pedic makes, so if you're the kind of person who loves the idea of sinking into a Tempur cloud, this might be your perfect fit. It's available in Twin, Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>TEMPUR-ES® Comfort Layer - 5cm<\/strong><br\/>Our softest material quickly begins conforming to your body to soothe and relax.<\/li><li><strong>TEMPUR-APR™ Support Layer - 5cm<\/strong><br\/>Our most pressure-relieving material ever — made for deeper, more rejuvenating sleep.<\/li><\/ol>"
          }
        },
        "4b1084a2-0135-46a9-bd7b-239a9835e48f": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "c39a2a83-1a0c-4ce3-955a-c9ca8ba7660a": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/TempurPedic_LuxeAdapt_Soft_Queen_Lifestyle.jpg",
            "title": "",
            "img_color": "",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "835a2765-a02b-4fe1-b7c8-f86a0409b6cb": {
          "type": "text",
          "settings": {
            "index_par": "Tempur-LuxeAdapt® Collection",
            "content": "<h2>Tempur-LuxeAdapt® Collection<\/h2><p><br\/>From the LuxeAdapt line of mattresses, you have these options:<\/p><h3><br\/><a href=\"\/products\/tempurpedic-luxeadapt-firm-mattress\" target=\"_blank\" title=\"Tempur-Pedic LuxeAdapt Firm Mattress\">TEMPUR-LuxeAdapt Firm Mattress<\/a><\/h3><p><br\/><br\/>Combining a very firm feel with incredible pressure-relieving technology is what this mattress is known for! In a firm feel, you won't find a bed that conforms to your unique shape better than the Tempur-Pedic LuxeAdapt® Firm Mattress. One of the best features of this mattress is the removable, washable cover. It easily zips right off the top of the mattress so you can toss it in the washing machine quickly. This is one of the firmest mattresses Tempur-Pedic has to offer, so if that's what you're looking for you're in luck! TEMPUR-LuxeAdapt® mattresses are available in Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>Original TEMPUR® Comfort Layer - 7cm<\/strong><br\/>Advanced, all-night adaptability for truly personalized comfort and support.<\/li><li><strong>TEMPUR-APR+™ Support Layer - 5cm<\/strong><br\/>All the pressure relief of APR Material, plus 30% more ultra-conforming comfort.<br\/><br\/><\/li><\/ol><h3><a href=\"\/products\/tempurpedic-luxeadapt-soft-mattress\" target=\"_blank\" title=\"Tempur-Pedic LuxeAdapt Soft Mattress\">TEMPUR-LuxeAdapt Soft Mattress<\/a><\/h3><p><br\/>This LuxeAdapt® technology will give you that awesome feeling of melting into your mattress. Tempur-Pedic's LuxeAdapt® Soft Mattress literally contains the best technology available to relieve your pressure points. Designed to conform to every curve of your body and give you support exactly where you need it, so you won't wake up in the morning with that hip and shoulder pain. This is the softest Tempur-Pedic mattress on the market, so check it out if you love to snuggle into your mattress at night! TEMPUR-LuxeAdapt® mattresses are available in Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>TEMPUR-ES® Comfort Layer - 9cm<\/strong><br\/>Our softest material quickly begins conforming to your body to soothe and relax.<\/li><li><strong>TEMPUR-APR+™ Support Layer - 3cm<\/strong><br\/>All the pressure relief of APR Material, plus 30% more ultra-conforming comfort.<br\/><\/li><\/ol>"
          }
        },
        "cbed33c1-94c0-4361-83c7-6cc50a56d9ab": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": false
          }
        },
        "1e1003a0-6ee9-43d7-bcb6-fda368ba277b": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/33027-TEMBreezeESBPDPsOct22_PRObreeze_MED_Hybrid_ATF_A_07IC1.jpg",
            "title": "",
            "img_color": "",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "09c6df60-a177-4e6c-8663-83454043dcd3": {
          "type": "text",
          "settings": {
            "index_par": "Tempur-ProBreeze® Collection",
            "content": "<h2>Tempur-ProBreeze® Collection<\/h2><p><br\/>For those who want to keep it cool, here are your options.<br\/><\/p><h3><br\/><a href=\"\/products\/tempurpedic-probreeze-medium-mattress\" target=\"_blank\" title=\"Tempur-Pedic ProBreeze Medium Mattress\">Tempur-Pedic ProBreeze Medium Mattress<\/a><br\/><\/h3><p><br\/>If you're the type to sleep hot and sweaty, the TEMPUR-ProBreez® mattress is for you! It's designed to keep your body up to 5° cooler. This mattress will support you comfortably no matter how you sleep - and it will make sure you don't sleep hot! The Tempur-Pedic ProBreeze® Medium Mattress has some of the best technology available to help make sure you sleep cooler. It's a true medium feel, so it will accommodate many sleeping positions and preferences. A lot of couples choose this mattress when one person prefers a different feel than the other. That's why we call it \"The Happy Medium\" here at Sleep First! It's available in Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<\/h4><h4><\/h4><ol><li><strong>Pure Cool® Material - 4cm<\/strong><br\/>An exclusive Tempur-Pedic® technology, this innovative material is designed to pull heat away from your body to help you sleep cool, all night long.<\/li><li><strong>Ventilated Advanced Relief™ Material - 5cm<\/strong><br\/>One-of-kind pressure-relieving material, enhanced with added ventilation for increased airflow— for deeper, more restful sleep.<br\/><\/li><\/ol><h3><a href=\"\/products\/tempurpedic-probreeze-medium-hybrid-mattress\" target=\"_blank\" title=\"Tempur-Pedic ProBreeze Medium Hybrid Mattress\">Tempur-Pedic ProBreeze Medium Hybrid Mattress<\/a><\/h3><p><br\/><br\/>For a hybrid mattress designed to keep your body up to 5° cooler, check out the Tempur-Pedic ProBreeze® Medium Hybrid Mattress. It's great if you're in the market for a mattress that has unsurpassed comfortable support, but you also love the feel of those bouncy innerspring mattresses. Not only does this mattress let you move easier in bed, but it also makes sure you sleep cooler than any other mattress you've tried! It has a medium feel, so it's got you covered no matter how you sleep! A very popular choice for couples. It's available in Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>Pure Cool® Material - 4cm<\/strong><br\/>An exclusive Tempur-Pedic® technology, this innovative material is designed to pull heat away from your body to help you sleep cool, all night long.<\/li><li><strong>Ventilated Advanced Relief™ Material - 5cm<\/strong><br\/>One-of-kind pressure-relieving material, enhanced with added ventilation for increased airflow— for deeper, more restful sleep.<\/li><li><strong>Proprietary Hybrid Technology<\/strong><br\/> Over 1,000« premium innersprings complement our one-of-a-kind pressure-relieving and cooling materials to deliver the right combination of pressure relief and support.<br\/><\/li><\/ol>"
          }
        },
        "ec6cb608-88ca-4406-8eb9-146065b370f8": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "685d5a53-944d-41a3-bdd6-50ccdd67a834": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/33027-TEMBreezeESBPDPsOct22_LUXEbreeze_SOFT_ATF_A_05IC1.jpg",
            "title": "",
            "img_color": "",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "7549ca07-b2b4-4e2e-bea4-399f29c4a680": {
          "type": "text",
          "settings": {
            "index_par": "Tempur-LuxeBreeze® Collection",
            "content": "<h2>Tempur-LuxeBreeze® Collection<\/h2><h3><br\/><a href=\"\/products\/tempur-luxebreeze-soft-mattress\" target=\"_blank\" title=\"Tempur-Pedic LuxeBreeze Soft Mattress\">Tempur-Pedic LuxeBreeze Soft Mattress<\/a><\/h3><p><br\/><br\/>This is the perfect mattress for you if you sleep hot and like the feeling of sleeping on a cloud! When you sleep on the Tempur-Pedic LuxeBreeze® Soft Mattress, you won't wake up in the middle of the night kicking the blankets to the floor anymore. It literally has the best technology available to help give you a cooler, deeper night's sleep. This is one of the softest Tempur-Pedic mattresses available, so it's the one to pick if you want to sink into a nice cool cloud at night. It's available in Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>Pure Cool® Plus Material - 4cm<\/strong><br\/>An enhanced version of our exclusive and innovative cooling material, designed to pull heat away from your body.<\/li><li><strong>Ventilated Advanced Relief™ Material - 7cm<\/strong><br\/>One-of-kind pressure-relieving material, enhanced with added ventilation for increased airflow—for deeper, more restful sleep.<br\/><\/li><\/ol><h3><a href=\"\/products\/tempur-luxebreeze-medium-hybrid-mattress\" target=\"_blank\" title=\"Tempur-Pedic LuxeBreeze Medium Hybrid Mattress\">Tempur-Pedic LuxeBreeze Medium Hybrid Mattress<\/a><\/h3><p><br\/><br\/>A truly remarkable sleep solution designed to keep your body up to 10° cooler, providing one of the coolest and most restful nights of sleep imaginable! The LuxeBreeze® Medium Hybrid Mattress is designed to accommodate different sleep preferences and spaces. Experience the extraordinary combination of TEMPUR-LuxeBreeze® cooling technology and hybrid construction, creating a cool and comfortable haven that ensures you wake up feeling refreshed and free from the discomfort of overheating in the middle of the night. It's one of Tempur-Pedic's impressive medium hybrid mattresses, catering to those who appreciate the ideal balance of support and comfort. It’s available in various sizes, including Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>Pure Cool® Plus Material - 3cm<\/strong><br\/>An enhanced version of our exclusive and innovative cooling material, designed to pull heat away from your body.<\/li><li><strong>Hybrid Material - 4cm<br\/><\/strong>Responsive material that enhances the feel of the Hybrid Technology to provide easier movement in bed and increased edge support.<\/li><li><strong>Ventilated Advanced Relief™ Material - 5cm<\/strong><br\/>One-of-kind pressure-relieving material, enhanced with added ventilation for increased airflow— for deeper, more restful sleep.<\/li><li><strong>Proprietary Hybrid Technology<\/strong><br\/>Over 1,300 premium, double-stacked innersprings provide a lighter, more responsive feel that helps support any sleep position.<br\/><\/li><\/ol><h3><a href=\"\/products\/tempur-luxebreeze-firm-mattress\" target=\"_blank\" title=\"Tempur-Pedic LuxeBreeze Firm Mattress\">Tempur-Pedic LuxeBreeze Firm Mattress<\/a><\/h3><p><br\/><br\/>Designed to keep your body up to 10° cooler, the TEMPUR-LuxeBreeze® mattress is one of the coolest sleeps you can get! If you sleep hot and love a firm bed, look no further that this Tempur-Pedic LuxeBreeze® Firm Mattress! This bed uses the best technology available to be sure you don't wake up in the middle of the night feeling hot and miserable! It's one Tempur-Pedic's firmer mattresses, so if you are looking for a super soft feel this wouldn't be for you. It's available in Twin XL, Full (Double), Queen, King, Cal King, and Split Cal King.<\/p><h4><br\/>Layers:<br\/><\/h4><ol><li><strong>Pure Cool® Plus Material - 5cm<\/strong><br\/>An enhanced version of our exclusive and innovative cooling material, designed to pull heat away from your body.<\/li><li><strong>Ventilated Advanced Relief™ Material - 6cm<\/strong><br\/>One-of-kind pressure-relieving material, enhanced with added ventilation for increased airflow—for deeper, more restful sleep.<br\/><\/li><\/ol>"
          }
        },
        "f81b929d-5f81-40ff-83f1-dca04f47066f": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "7cff807c-ed22-439b-a271-513680b505b2": {
          "type": "image",
          "settings": {
            "index_img": "",
            "image": "shopify:\/\/shop_images\/Tempur_LuxeBreezeHybrid_ErgoSmart_Queen_Talent_250223003700790610_lowres.jpg",
            "title": "",
            "img_color": "",
            "top_i": true,
            "bottom_i": true,
            "size": false
          }
        },
        "dcc3e43d-f822-45f8-98c2-c0da79a14b75": {
          "type": "text",
          "settings": {
            "index_par": "Tempur-Pedic Mattresses with Adjustable Bases",
            "content": "<h2>Tempur Pedic Mattresses with Adjustable Bases<\/h2><p><br\/><br\/>For next-level sleep, consider an adjustable base. TEMPUR-Ergo® Smart Bases offer next-level sleep with automatic snore detection, automatic snore response,* expert analytics, personalized coaching, and smart home compatibility with voice control.<br\/><br\/><\/p><h3><a href=\"\/products\/tempur-ergo-adjustable-power_base\" target=\"_blank\" title=\"TEMPUR-Ergo® Power Base\">TEMPUR-Ergo® Adjustable Power Base<\/a><\/h3><p><br\/>This is a more advanced model of Tempur bases, which offers more features and benefits than the Ease Power Base. In addition to adjusting the head and foot positions of your bed, the Ergo Power Base also provides lumbar support, which can help you maintain a healthy spine alignment and reduce back pain.<br\/>The Ergo Power Base also has a QuietMode™ feature, which gently tilts your mattress to an anti-snore position with a press of a button on the wireless remote control. This can help you breathe easier and sleep more peacefully. Additionally, the Ergo Power Base includes USB ports, massage, and under-bed illumination features which can increase your comfort and satisfaction. With the Ergo Power Base, you can rest your muscles, charge your devices, and make your bedroom feel pleasant.<br\/><br\/><\/p><h3><a href=\"\/products\/tempur-ergo-smartbase-adjustable-power-base\" target=\"_blank\" title=\"TEMPUR-Ergo® Smart Base\">TEMPUR-Ergo® Smart Base <\/a><\/h3><p><br\/><br\/>This is a smart model of Tempur bases, which has all the features of the Ergo Power Base, plus smart technology that can track your sleep, respond to snoring, and provide personalized coaching. The Ergo Smart Base uses a pair of non-intrusive sleep monitoring sensors to capture your sleep data, without the use of wearables, microphones, or cameras. You can opt-out or pause your sleep tracking at any time with a single tap. The Ergo Smart Base can sense snoring and automatically raise your head to a position that may reduce snoring with the Snore Response™ feature. You can also use the QuietMode™ feature to manually adjust your bed to an anti-snore position. The Ergo Smart Base can provide you with a customized sleep report and coaching every morning, based on your sleep patterns and quality. You can see how well you slept, how long you spent in different sleep stages, and what factors affected your sleep quality. You can also get tips and insights on how to improve your sleep habits and achieve your sleep goals. The Ergo Smart Base can also connect with compatible Google Home and Amazon Alexa devices, allowing you to use voice commands to control the base, get your daily sleep reports, and receive personalized sleep tips. You can also control the base with your smartphone app or wireless remote control.<br\/><br\/><\/p><h3><a href=\"\/products\/tempur-ergo-extend\" target=\"_blank\" title=\"TEMPUR-Ergo® ProSmart™ Base\">TEMPUR-Ergo® ProSmart Base<\/a><\/h3><p><br\/><br\/>This is a new model of Tempur bases, which offers an innovative sleep solution that can detect snoring and automatically respond, which may help reduce it, so you don’t have to be disturbed during the night.  The Ergo ProSmart Base also provides the Wave Form™ Massage, which uses sound waves to transmit vibrations from the base throughout the mattress to help promote relaxation by easing muscle tension.  It has all the features of the Ergo Extend Smart Base, plus a SoundScape™ Mode, which is an immersive experience that allows you to both hear and feel sound through the mattress. By connecting devices that use Bluetooth® wireless technology, you can choose sounds or even songs to help you relax for sleep. The Ergo ProSmart Base also has a Wind Down™ feature, which is a preset program option that cycles through different base positions and soothing massage types so you can calmly and comfortably drift off to sleep. <\/p>"
          }
        },
        "a550151b-c44f-4987-a374-8841de84e2c6": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "3282a52b-44b9-4750-837f-26b90458f33b": {
          "type": "text",
          "settings": {
            "index_par": "What is the Right Tempur-Pedic Mattress for Me?",
            "content": "<h2>What is the Right Tempur-Pedic Mattress for Me?<\/h2><p><br\/><br\/>Tempur Pedic offers a range of memory foam mattresses designed for pressure relief and restorative sleep at different price points. The right type of mattress depends on your sleeping needs, comfort levels, and bed size. Keep the following things in mind when choosing Tempur-Pedic Mattresses.<br\/><br\/><\/p><h3>Think of your sleep position<\/h3><p><br\/>Stomach and back sleepers often require a firmer mattress for proper spine alignment. Side sleepers can benefit from a softer mattress made from TEMPUR-ES®, which also provides enough spinal support. If you've been sleeping on an old mattress that doesn't suit your sleeping position, narrow down your options along this line. Fortunately, Tempur-Pedic offers a range of surface comforts, making it easy to find the best Tempur-Pedic mattress for your sleeping position.<br\/><br\/><\/p><h3>Are you a hot sleeper?<\/h3><p><br\/>If you usually sleep warm, there's a good chance your mattress has a hand in it. Many Tempur-Pedic reviews indicate that certain types of beds contribute to hot sleep as their materials tend to hug the body. Choosing a Tempur foam mattress that has firmer surface can help promote airflow during sleep.<br\/><br\/><\/p><h3>Body weight<\/h3><p><br\/>People with heavy bodies will sink more into foams, no matter how dense the material is. Firmer mattresses, including those with inner spring can provide the extra body support you need. Best of all, they may hold up for longer.<br\/><br\/><\/p><h3>Your budget<\/h3><p><br\/>If your budget is tight, you need to consider your sleeping needs and comfort levels in regard to what you can afford to purchase. Tempur-Pedic is a premium mattress brand that's known to deliver high quality mattresses. With superior construction and materials comes a higher price tag. Many decent alternatives are available if you can't find a mattress at the right price.<br\/><br\/><\/p><h3>Mattress foundation<\/h3><p><br\/>Your choice of mattress foundation also matters when buying a queen or king size Tempur-Pedic mattress. We recommend platform beds for memory foam as they provide a flat surface for proper back support. Most platform beds cost less than traditional bed frames. For the best sleep experience, get a Tempur-Pedic bed frame that's optimized for your mattress type.<br\/><\/p>"
          }
        },
        "0e011940-796a-442d-828b-c32f6bea2ab3": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "8d335bf8-0677-4faa-9bd5-b4a1bcd473ff": {
          "type": "text",
          "settings": {
            "index_par": "What Customers Are Saying About Tempur-Pedic",
            "content": "<h2>What Customers Are Saying About Tempur-Pedic<\/h2><p><br\/><br\/>“Alex was very helpful with our first Tempur-Pedic purchase. He didn't pressure us into buying anything and was very knowledgeable. We enjoyed our experience at Sleep First.”  <br\/><em><strong>-Jana Lazarewicz<br\/><\/strong><\/em><br\/>“Aaron helped us with purchasing yet another Tempur-Pedic bed. There was no way we couldn't get anything other than another Tempur-Pedic for us. But we didn't at all feel pressured as you do at a car dealership. He was very knowledgeable and showed us the differences between each type. If you need any assistance in getting the top of the line beds as in Tempur-Pedic, Aaron is your guy.”<br\/><em><strong>-Linda Perniz<\/strong><\/em><br\/><br\/>“The best bed I have ever owned. I literally just slept 12 hours the first day having the Tempur-Pedic w\/adjustable base. They definitely were professional and genuinely cared about my wants in a new bed. I highly recommend this place. Thanks to Ashley and her manager Keni. They really did take care of me and my wife we are beyond satisfied with our purchase and the service we were given.” <br\/><em><strong>-Everett Parker<\/strong><\/em><\/p>"
          }
        },
        "c1632e27-98bb-45e4-8ae6-41e6d68e709e": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": true
          }
        },
        "45a1de72-0d1e-4f58-85bf-12fe51d1912f": {
          "type": "text",
          "settings": {
            "index_par": "Interested in Mattress Financing?",
            "content": "<h2>Interested in Mattress Financing?<\/h2><p><br\/><br\/>Applying for financing is fast, easy, and secure! Once your application has been approved by one of our financing partners, simply print your approval confirmation and bring it to any Sleep First store location. <a href=\"\/pages\/online-financing\" target=\"_blank\" title=\"Online Financing\">Click here to learn more and apply today.<\/a><br\/><\/p>"
          }
        },
        "1237f54d-a7a4-422d-aeb7-64a41f0013d5": {
          "type": "slide",
          "disabled": true,
          "settings": {
            "index_fra": "",
            "icon": "https:\/\/cdn.shopify.com\/s\/files\/1\/0248\/6163\/8710\/files\/Person.svg?v=1682014048",
            "frameText": "Asthma and chronic pain are two illnesses that can be made worse by poor sleep hygiene. ",
            "top_f": true,
            "bottom_f": false
          }
        },
        "11c7870f-5eaa-452f-9a8b-6a5254147137": {
          "type": "section",
          "settings": {
            "index_div": "",
            "divider_color": "#7992eb",
            "top": true,
            "bottom": false
          }
        }
      },
      "block_order": [
        "1a590ddc-2ad7-46f6-9d96-57c79b562975",
        "0bde299d-d2ed-4afa-8d44-dde79fc1bde8",
        "00c5c3c8-f44e-4fff-8011-b53508dad711",
        "a048c091-0c87-4ea9-9aa2-63074b6a64c7",
        "7864ce1f-275d-420f-b8dc-534cbfd3ee27",
        "294863e7-3749-4c70-b0b5-11a26dcfc911",
        "7388edfa-1b33-44da-8af4-aa6568244ef5",
        "9e7f9717-3fb8-4886-a312-07b884bf27ae",
        "df7b3de4-8f5b-4afc-a5d4-03f623f572d1",
        "a6e87b17-5469-44ab-aeaa-11878cd587fa",
        "85c24529-c44f-46e7-8efc-9b87edbaa59b",
        "4b1084a2-0135-46a9-bd7b-239a9835e48f",
        "c39a2a83-1a0c-4ce3-955a-c9ca8ba7660a",
        "835a2765-a02b-4fe1-b7c8-f86a0409b6cb",
        "cbed33c1-94c0-4361-83c7-6cc50a56d9ab",
        "1e1003a0-6ee9-43d7-bcb6-fda368ba277b",
        "09c6df60-a177-4e6c-8663-83454043dcd3",
        "ec6cb608-88ca-4406-8eb9-146065b370f8",
        "685d5a53-944d-41a3-bdd6-50ccdd67a834",
        "7549ca07-b2b4-4e2e-bea4-399f29c4a680",
        "f81b929d-5f81-40ff-83f1-dca04f47066f",
        "7cff807c-ed22-439b-a271-513680b505b2",
        "dcc3e43d-f822-45f8-98c2-c0da79a14b75",
        "a550151b-c44f-4987-a374-8841de84e2c6",
        "3282a52b-44b9-4750-837f-26b90458f33b",
        "0e011940-796a-442d-828b-c32f6bea2ab3",
        "8d335bf8-0677-4faa-9bd5-b4a1bcd473ff",
        "c1632e27-98bb-45e4-8ae6-41e6d68e709e",
        "45a1de72-0d1e-4f58-85bf-12fe51d1912f",
        "1237f54d-a7a4-422d-aeb7-64a41f0013d5",
        "11c7870f-5eaa-452f-9a8b-6a5254147137"
      ],
      "settings": {
        "introduction": "<p>When it comes to mattresses, everyone has their own unique needs and preferences. People are diverse, and so are mattresses. That means certain sizes, feels, materials, and even brands work best for different people. <br\/><br\/>Here at Sleep First, we're happy to be able to offer mattresses from some of the very best brands and beddings including mattress toppers. From <a href=\"\/collections\/nectar-mattress\" target=\"_blank\" title=\"Nectar Mattresses\">Nectar <\/a>and <a href=\"\/collections\/tempur-pedic-mattress-collection\" target=\"_blank\" title=\"Tempur-Pedic® Mattress Collection\">Tempur-Pedic<\/a> to <a href=\"\/collections\/sealy-mattress-collection\" target=\"_blank\" title=\"Sealy Mattress Collection\">Sealy<\/a> and <a href=\"\/collections\/dreamcloud\" target=\"_blank\" title=\"DreamCloud\">DreamCloud<\/a>, there is something here for every sleep need and preference. Curious to know what brand might be the best choice for you? In this post, we're continuing our mattress brand guide with one of the best mattress brands in the industry: the Tempur-Pedic Mattress, so you won't waste time going through a ton of mattress reviews online.<br\/><\/p>",
        "recap": "<h2><strong>Why Buy Your Mattress from Sleep First?<\/strong><\/h2><p><br\/>Sleep First is your locally owned Tempur-Pedic Elite Retailer. We have every model of Tempur-Pedic, including the king and queen mattress, in our showroom for you to try, so you can fall in love before you buy it! When you purchase a TEMPUR® product from Sleep First, we provide an incredible 20 Year Full Replacement Warranty - doubling the 10 years that Tempur themselves provide. Your additional 10 years kicks in when your manufacturer's warranty expires.<br\/><br\/>Since your comfort is our #1 priority, we offer an industry-leading 365-day comfort trial, so you don't have to worry about a thing while you take one full year to decide whether to keep your new mattress. Your purchase price is also guaranteed for a full year, and we'll refund the difference if you see the same bed advertised cheaper elsewhere.<br\/><br\/>And - of course - your Tempur mattress will always come with the unsurpassed service and knowledge of our dedicated Sleep First team, who can help you find the best Tempur-Pedic mattress! You'll feel no pressure during any purchase or exchange from your friendly local owners. We appreciate your shopping locally instead of choosing a national chain, keeping money and jobs in our local community.<br\/><\/p>",
        "posts_heading": "Related Posts"
      }
    }
  },
  "order": [
    "main",
    "17e412db-3680-4e78-8669-fb18b9a93869"
  ]
}
